//Задание 1. ввести первый символ ch1 
//Задание 2. ввести второй символ ch2 
//Задание 3. вывести каждый символ и его код ASCII 
//Задание 4. вывести сумму кодов ASCII символов ch1 и ch2

//Пожалуйста, введите номер действия или 0, если вы хотите закрыть программу

#include <iostream>
#include <string>

using namespace std;

char inputFirstChar() {
    char ch;
    cout << "Введите первый символ: ";
    cin >> ch;
    return ch;//branch_fun_1
}

// Функция для ввода второго символа
char inputSecondChar() {

}


// Функция для вывода символа и его кода ASCII
void printCharAndAscii() {

}

// Функция для вывода суммы кодов ASCII
void printAsciiSum(char ch1, char ch2) {

}

